:PROPERTIES:
:ID: da5bad46-9209-48aa-8ab0-bd9cd0c3d365
:END:
#+title: emacs-orgmode-archive

*** DONE 表格怎么写计算表达式
- State "DONE" from [2024-08-11 Sun 00:38]
| Hex | Dec |
|-----+-----|
| 1A  |  26 |
| 2B  |  43 |
| 3C  |  60 |
#+TBLFM: $2='(string-to-number $1 16)
| Hex 1 | Hex 2 | Diff |
|-------+-------+------|
| 1A    | 0A    | 0x10 |
| 2B    | 1B    | 0x10 |
| 3C    | 2C    | 0x10 |
#+TBLFM: $3='(format "0x%X" (- (string-to-number $1 16) (string-to-number $2 16)))
